using BridgeBaseComponents;
using System;
using System.Collections.Generic;
using System.Collections.ObjectModel;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace 新建桥类
{
    public static class 悬索桥v2
    {
        public static 桥梁组成二级部件 桥面铺装 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.4,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("变形",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"局部出现波浪拥包;或局部有高低不平的现象;或局部出现车辙,深度较浅。","波浪拥包面积≤10%,波峰波谷高差≤25mm;高低差≤25mm;铺装层出现车辙的面积≤10%,深度≤25mm."),
new 标度及其说明(3,"多处出现波浪拥包;或多处有高低不平的现象;或较大面积出现车辙,深度较浅。","波浪拥包面积>10%,且≤20%,波峰波谷高差≤25mm;高低差≤25mm;铺装层出现车辙的面积>10%,且≤20%,深度≤25mm."),
new 标度及其说明(4,"大面积出现波浪拥包;或普遍有高低不平的现象;或大面积出现车辙。","波浪拥包面积>20%,波峰波谷高差>25mm;高低差>25mm;铺装层出现车辙的面积>20%,深度>25mm."),
}
),
new 检查指标("泛油",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"局部出现泛油","面积≤10%"),
new 标度及其说明(3,"多处出现泛油","面积>10%,且≤20% "),
new 标度及其说明(4,"大面积出现泛油、磨光","面积>20%"),
}
),
new 检查指标("破损",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"面层局部松散、露骨;或局部浅坑槽","松散、露骨累计面积≤10% ;坑槽深度≤25mm,累计面积≤3%,单处面积≤0.5平方米"),
new 标度及其说明(3,"多处松散、露骨;或多处出现坑槽 ","松散、露骨累计面积>10%,且≤20%;坑槽深度≤25mm,累计面积>3%且≤10%,单处面积>0.5 平方米且≤1.0平方米"),
new 标度及其说明(4,"大部分松散、露骨; 大部分有坑槽 ","松散、露骨累计面积>20%;坑槽深度>25mm,累计面积>10%,单处面积>1.0平方米 "),
}
),
new 检查指标("裂缝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"局部龟裂,裂缝区无变形、无散落;或局部块裂,裂缝区无散落; 或有纵横裂缝,裂缝壁无散落,无支缝","龟裂缝宽≤2.0mm,部分裂缝块度≤5.0m ;块裂缝宽≤3.0mm,大部分裂缝块度>1.0m;纵横裂缝缝长≤1.0m,缝宽≤3.0mm "),
new 标度及其说明(3,"局部龟裂,状态明显,裂缝区有轻度散落或变形;或局部块裂,裂缝区有散落;或有纵横裂缝,裂缝壁有散落,有支缝 ","龟裂缝宽>2.0mm,且<5.0mm,部分裂缝块度≤2.0m;块裂缝宽>3.0mm,大部分裂缝块度>0.5m且≤1.0m;纵横裂缝缝长>1.0m且≤2.0m,缝宽>3.0mm"),
new 标度及其说明(4,"多处龟裂,特征显著,裂缝区变形明显、散落严重; 或多处块裂,裂缝区散落严重;或有纵横通缝,裂缝壁散落,支缝严重 ","龟裂缝宽>5.0mm,大部分裂缝块度≤2.0m;块裂缝宽>3.0mm,大部分裂缝块度≤0.5m;纵横裂缝缝长>2.0m,缝宽>3.0mm "),
}
),
}
        };
        public static 桥梁组成二级部件 伸缩缝 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.25,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("凹凸不平",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"略有凹凸不平","差值≤1cm "),
new 标度及其说明(3,"有明显凹凸不平","差值>1cm且≤3cm "),
new 标度及其说明(4,"严重凹凸不平","差值>3cm"),
}
),
new 检查指标("锚固区缺陷",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"锚固构件松动,或锚固螺栓松脱; 或混凝土轻微损坏,出现裂缝、剥落现象","数量≤10%;面积≤10% "),
new 标度及其说明(3,"锚固构件松动,或锚固螺栓松脱但功能尚存;或混凝土局部损坏;","数量>10%且≤20%;面积>10%且≤20% "),
new 标度及其说明(4,"锚固构件松动,或锚固螺栓松脱基本失效; 或混凝土大面积破损","数量>20%; 面积>20%"),
}
),
new 检查指标("破损",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"锚固构件松动、缺失,或焊缝开裂;或橡胶条轻微损坏、老化; 或排水管发生轻微破损、但不影响功能","数量≤10%;面积≤20%"),
new 标度及其说明(3,"锚固构件松动、缺失,或焊缝开焊,造成钢板破损;或橡胶条老化、剥离;或焊接处大部分出现裂缝,但未断裂;或防水材料老化并有局部脱落现象,或排水管破损、堵塞,尚能维持功能 ","数量>10%且≤20%;面积>20 % "),
new 标度及其说明(4,"严重老化,锚固构件松动、缺失,或焊缝开焊,造成钢板破损失效; 或焊接处出现剪断现象,或钢板其他部位出现剪断现象; 或橡胶条完全剥离或脱落; 或防水材料老化,完全脱落,或排水管完全堵塞失效","数量>20% "),
}
),
new 检查指标("失效",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"上层槽口堵塞、卡死等原因,造成伸缩缝伸缩异常,车辆行驶时出现冲击和噪声",""),
new 标度及其说明(3,"上层槽口堵塞、卡死等原因,造成伸缩缝不能自由变形,伸缩异常现象严重,伸缩缝出现明显损坏",""),
new 标度及其说明(4,"伸缩异常导致失效",""),
}
),
}
        };
        public static 桥梁组成二级部件 人行道 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.1,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("破损",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"出现少量坑槽、孔洞、裂缝、剥落、松动等现象","面积≤10% "),
new 标度及其说明(3,"出现较多坑槽、孔洞、裂缝、剥落、松动等现象","面积>10%且≤20% "),
new 标度及其说明(4,"出现大量坑槽、孔洞、裂缝、剥落、松动等现象","面积>20%"),
}
),
new 检查指标("缺失",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"人行道出现少量缺失现象","面积≤3% "),
new 标度及其说明(3,"人行道出现较大面积缺损;","面积>3%且≤10% "),
new 标度及其说明(4,"人行道出现大面积缺损","面积>10%"),
}
),
}
        };
        public static 桥梁组成二级部件 栏杆及护栏 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.1,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("撞坏或缺失",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"局部受到车辆冲撞,不影响功能,或构件脱落、缺失","损坏长度≤3% "),
new 标度及其说明(3,"多处出现车辆冲撞引起的损坏,不影响功能,或构件脱落、缺失","损坏长度>3%且≤10% "),
new 标度及其说明(4,"受到车辆冲撞,失去效用,或构件脱落、缺失","损坏长度>10%"),
}
),
new 检查指标("破损",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"个别构件出现蜂窝麻面、剥落、锈蚀、裂缝、变形错位等现象","累计面积≤10% "),
new 标度及其说明(3,"较多构件出现蜂窝麻面、剥落、露筋、锈蚀、裂缝、变形错位等现象;","面积>10%且≤20% "),
new 标度及其说明(4,"大量构件出现剥落、露筋、锈蚀、裂缝、变形错位等现象","面积>20%"),
}
),
}
        };
        public static 桥梁组成二级部件 排水系统 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.1,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("排水不畅",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"局部排水不畅,桥下出现漏水现象,或桥台支承面、翼墙面等平面受到污水污染",""),
new 标度及其说明(3,"桥下多处出现漏水现象,或桥台支承面、翼墙面、前墙面等平面受到污水污染,支座锈蚀,或桥台后填料排水不畅,造成路堤轻微沉降",""),
new 标度及其说明(4,"桥下普遍出现漏水现象,或桥台支承面、翼墙面、前墙面等平面被污水严重污染,支座严重锈蚀,或桥台后填料排水不畅,造成路堤明显沉降",""),
}
),
new 检查指标("泄水管或引水槽缺陷",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"较少泄水管、引水槽、排水孔出现堵塞,或排水设施构件破损、缺件、管体脱落、漏留泄水管","数量≤5% "),
new 标度及其说明(3,"较多泄水管、引水槽、排水孔出现堵塞,或排水设施构件破损、缺件、管体脱落、漏留泄水管;","数量>5% "),
}
),
}
        };
        public static 桥梁组成二级部件 照明及标志 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.05,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("污损或损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"个别设施松动、锈蚀、损坏,或出现污损标志不清现象",""),
new 标度及其说明(3,"多处设施松动、锈蚀、损坏,或出现污损标志不清现象",""),
new 标度及其说明(4,"大部分设施松动、锈蚀、损坏,危及行车安全",""),
}
),
new 检查指标("照明设施缺损",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"少量照明设施缺失","数量≤10% "),
new 标度及其说明(3,"较多照明设施缺失;","数量>10%且≤20% "),
new 标度及其说明(4,"大量照明设施缺失,危及行车安全","数量>20%"),
}
),
new 检查指标("标志脱落缺失",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"个别标志脱落、缺失,或需要标志的位置没有相应标志",""),
new 标度及其说明(3,"多处标志脱落、缺失,或需要标志的位置没有相应标志",""),
}
),
}
        };
        public static 桥梁组成二级部件 混凝土主梁 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.15,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("剥落露筋",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"局部混凝土剥落或露筋","累计面积≤构件面积的3%,单处面积≤0.5平方米 "),
new 标度及其说明(3,"较大范围混凝土剥落或露筋","累计面积>构件面积的3%且≤构件面积的10%,单处面积≤0.5平方米 "),
new 标度及其说明(4,"大范围混凝土剥落或露筋","累计面积>构件面积的10%,单处面积>0.5平方米"),
}
),
new 检查指标("跨中挠度",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(3,"挠度未大于限值; ","跨中最大挠度<计算跨径的1/800 "),
new 标度及其说明(4,"挠度接近限值,主梁有明显变形,影响结构安全","跨中最大挠度≥计算跨径的1/800且≤计算跨径的1/500"),
new 标度及其说明(5,"主梁严重变形,挠度大于限值,梁板出现严重病害,有不正常移动并影响结构安全","跨中最大挠度>计算跨径的1/500 "),
}
),
new 检查指标("构件变形",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(3,"加劲梁横隔板等次要构件出现弯曲变形; ","无"),
new 标度及其说明(4,"加劲梁出现异常弯曲变形或线形明显变化,行车振动或摇晃明显或有异常音","无"),
new 标度及其说明(5,"加劲梁出现严重变形,导致梁板出现严重病害,显著影响承载力,结构振动或摇晃显著,有不正常移动","无"),
}
),
new 检查指标("混凝土裂缝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好,无裂缝","无"),
new 标度及其说明(2,"网状裂缝：局部网状开裂;竖向裂缝：少量裂缝,缝宽未超限; 纵向裂缝：结合面开裂或有其他纵向裂缝; 斜裂缝：少量裂缝,缝宽未超限","网状裂缝：累计面积≤构件面积的20%,单处面积≤5.0平方米 ;竖向裂缝：缝长≤截面尺寸的1/3; 纵向裂缝：缝长≤结合面长度或跨长的1/8; 斜裂缝：缝长≤截面尺寸的1/3 "),
new 标度及其说明(3,"网状裂缝：局部网状开裂;竖向裂缝：较多裂缝,缝宽未超限; 纵向裂缝：结合面开裂或有纵向裂缝; 斜裂缝：较多裂缝,缝宽未超限","网状裂缝：累计面积>构件面积的20%,单处面积>5.0平方米 ;竖向裂缝：缝长>截面尺寸的1/3且≤截面尺寸的1/2,间距≥30cm; 纵向裂缝：缝长>结合面长度或跨长的1/8且≤结合面长度或跨度的1/2; 斜裂缝：缝长>截面尺寸的1/3且≤截面尺寸的2/3"),
new 标度及其说明(4,"竖向裂缝：主梁控制界面出现大量裂缝,缝宽超限; 纵向裂缝：存在严重结合面开裂现象或有大量纵向裂缝; 斜裂缝：主梁控制截面出现大量裂缝,缝宽超限值","竖向裂缝：缝长>截面尺寸的1/2,缝宽>限值,间距<30cm; 纵向裂缝：缝长>结合面长度或跨长的1/2 ; 斜裂缝：缝长>截面尺寸的2/3,缝宽>限值 "),
new 标度及其说明(5,"竖向裂缝：主梁控制界面出现大量裂缝,裂缝大多贯通且缝宽超限,主梁出现严重变形; 斜裂缝：主梁控制截面出现大量裂缝且缝宽超限值,主梁出现严重变形","竖向裂缝：缝长>截面尺寸的1/2,缝宽>1.0mm,间距<10cm; 斜裂缝：缝长>截面尺寸的2/3,缝宽>1.0mm "),
}
),
new 检查指标("蜂窝麻面",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好,无蜂窝麻面","无"),
new 标度及其说明(2,"较大面积蜂窝麻面","累计面积≤构件面积的50% "),
new 标度及其说明(3,"大面积蜂窝麻面","累计面积>构件面积的50% "),
}
),
new 检查指标("剥落掉角",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好,无剥落、掉角","无"),
new 标度及其说明(2,"局部混凝土剥落或掉角; ","累计面积≤构件面积的5%,或单处面积≤0.5平方米 "),
new 标度及其说明(3,"较大范围混凝土剥落或掉角","累计面积>构件面积的5%且<构件面积的10%,或单处面积>0.5平方米且<1.0平方米"),
new 标度及其说明(4,"大范围混凝土剥落或掉角","累计面积≥构件面积的10%,或单处面积≥1.0平方米 "),
}
),
new 检查指标("空洞孔洞",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好,无空洞、孔洞","无"),
new 标度及其说明(2,"局部混凝土空洞、孔洞; ","累计面积≤构件面积的5%,或单处面积≤0.5平方米 "),
new 标度及其说明(3,"较大范围混凝土空洞、孔洞","累计面积>构件面积的5%且<构件面积的10%,或单处面积>0.5平方米且<1.0平方米"),
new 标度及其说明(4,"大范围混凝土空洞、孔洞","累计面积≥构件面积的10%,或单处面积≥1.0平方米 "),
}
),
new 检查指标("混凝土保护层厚度",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"承重构件混凝土保护层厚度符合要求,对钢筋耐久性有轻度影响; ","无"),
new 标度及其说明(3,"承重构件混凝土保护层厚度不足,对钢筋耐久性有较大影响,造成钢筋锈蚀","无"),
new 标度及其说明(4,"承重构件混凝土保护层厚度严重不足,对钢筋耐久性有很大影响,钢筋失去碱性保护,发生较严重锈蚀","无"),
}
),
new 检查指标("钢筋锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","承重构件钢筋锈蚀电位水平为0 ~ -200mV,或电阻率>20000Ω•cm "),
new 标度及其说明(2,"承重构件有轻微锈蚀现象; ","承重构件钢筋锈蚀电位水平为 -200 ~ -300mV,或电阻率为15000 ~ 20000Ω•cm "),
new 标度及其说明(3,"承重构件钢筋发生锈蚀,混凝土表面有沿钢筋的裂缝或混凝土表面有锈迹","承重构件钢筋锈蚀电位水平为 -300 ~ -400mV,或电阻率为10000 ~ 15000Ω•cm "),
new 标度及其说明(4,"承重构件钢筋锈蚀引起混凝土剥落,钢筋裸露,表面膨胀性锈层显著","承重构件钢筋锈蚀电位水平为 -400 ~ -500mV,或电阻率为5000 ~ 10000Ω•cm "),
new 标度及其说明(5,"承重构件大量钢筋锈蚀引起混凝土剥落, 部分钢筋屈服或锈断,混凝土表面严重开裂,影响结构安全","承重构件钢筋锈蚀电位水平为<-500mV,或电阻率<5000Ω•cm"),
}
),
new 检查指标("混凝土碳化",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"承重构件有少量碳化现象,且所有碳化深度均小于混凝土保护层厚度",""),
new 标度及其说明(3,"承重构件的主要受力部位部分位置出现碳化现象,局部碳化深度大于混凝土保护层厚度,混凝土表面少量胶凝料松散粉化 ",""),
new 标度及其说明(4,"承重构件的主要受力部位全部测点碳化且碳化深度大于混凝土保护层厚度,混凝土表面凝胶料大量松散粉化",""),
}
),
}
        };
        public static 桥梁组成二级部件 钢箱加劲梁 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.15,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("构件变形",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"构件轻微变形","钢材料构件竖向弯曲矢度<=杆件自由长度的1/1 500,或钢材料纵粱、横梁横向弯曲矢度<=杆件自由长度的1/8000"),
new 标度及其说明(4,"钢构件明显变形","钢材料构件竖向弯曲矢度>跨度的1/1 500且<=跨度的1/1 000,或钢材料纵梁、横梁横向弯曲矢度>杆件自由长度的1/8 000且<=杆件自由长度的1/5 000"),
new 标度及其说明(5,"钢构件严重变形,结构振动或摇晃显著,有不正常移动","钢材料构件竖向弯曲矢度>跨度的1/1 000,或钢材料纵梁、横梁横向弯曲矢度>杆件自由长度的1/5 000"),
}
),
new 检查指标("锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"构件表面锈蚀,且部分氧化皮或油漆层剥落; ","锈蚀累计面积<=构件面积的2%"),
new 标度及其说明(3,"构件表面有较多点烛现象,氧化皮或油漆层因锈蚀而部分剥落或者可以刮除,出现锈蚀成洞现象","锈蚀累计面积>构件面积的2%且<=构件面积的5%,或锈蚀孔洞<=2个,孔洞直径<=30mm,边缘完好,或腹板、横隔板洞孔直径<=50mm "),
new 标度及其说明(4,"构件表面有严重的点蚀现象,氧化皮或油漆层因锈蚀而全面剥离,较多部位被锈蚀成洞,影响构件安全","锈蚀累计面积>构件面积的5%,或锈蚀孔洞>2个,孔洞直径>30mm,或腹板、横隔板孔洞直径>50mm "),
}
),
new 检查指标("跨中挠度",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"跨中挠度未大于限值","跨中最大挠度<=计算跨径的1/600"),
new 标度及其说明(4,"跨中挠度大于限值","跨中最大挠度>计算跨径的1/600且<=计算跨径的1/400"),
new 标度及其说明(5,"跨中挠度大于限值,主梁严重变形,梁体出现严重病害,有不正常移动并影响结构安","跨中最大挠度>计算跨径的1/400"),
}
),
new 检查指标("裂缝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"钢构件出现极少量细小裂纹",""),
new 标度及其说明(3,"钢构件出现较多细小裂缝,截面削弱","加劲梁、纵横梁受拉翼缘边裂缝长度<=3mm,或受拉翼缘焊接盖板端部裂缝长度<=10mm"),
new 标度及其说明(4,"钢构件出现较多裂缝,截面削弱","加劲梁、纵横梁受拉翼缘边裂缝长度>3mm且<=5mm,或受拉翼缘焊接盖板端部裂缝长度>10mm且<=20mm "),
new 标度及其说明(5,"钢构件严重裂缝,主梁变形,截面削弱,造成严重安全隐患","加劲梁、纵横梁受拉翼缘边裂缝长度>5mm ,或受拉翼缘焊接盖板端部裂缝长度>20mm "),
}
),
new 检查指标("涂层劣化",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"涂层个别位置出现流痕、气泡、白化、漆膜发黏、针孔、起皱或皱纹、表面粉化、变色起皮、脱落等缺陷","累计面积<=构件面积的10% "),
new 标度及其说明(3,"涂层出现较严重流痕、气泡、白化、漆膜发黏、针孔、起皱或皱纹、表面粉化、变色起皮、脱落等缺陷","累计面积>构件面积的10%且<=构件面积的50%"),
new 标度及其说明(4,"涂层出现严重流痕、气泡、白化、漆膜发黏、针孔、起皱或皱纹、表面粉化、变色起皮、脱落等缺陷","累计面积>构件面积的50%"),
}
),
new 检查指标("焊缝开裂",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"焊缝部位涂层有少量裂纹",""),
new 标度及其说明(3,"焊缝部位涂层有大量裂纹,受拉翼缘边焊缝存在裂缝,其他部位焊缝无裂缝","累计面积>构件面积的5%且<构件面积的10%,或单处面积>0.5m2且<1.0m2"),
new 标度及其说明(4,"主要构件焊缝出现较多裂缝,构件出现变形","主粱、纵横粱受拉翼缘边焊缝开裂长度>5mm且<=10mm,其他位置焊缝开裂长度<=5mm "),
new 标度及其说明(5,"主要构件焊缝存在大量裂缝甚至完全开裂,主要构件存在明显的变形,变形大于规范值","主梁、纵横粱受拉翼缘边焊缝开裂长度>10mm,其他位置焊缝开裂长度>5mm "),
}
),
new 检查指标("铆钉或螺栓",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"铆钉〈螺栓)少量损坏、松动或丢失,造成联结部位铆钉〈螺栓)失效","损坏、失效数量<总量的1%"),
new 标度及其说明(3,"铆钉〖螺栓)有较多损坏、松动或丟失,造成联结部位铆钉〈螺栓)失效","损坏、失效数量>总量的1%且<=总量的10%"),
new 标度及其说明(4,"主要构件铆钉〈螺栓)有较多损坏、松动或丢失,造成联结部位铆钉〈螺栓)失效,构件出现明显变形","损坏、失效数量>总量的10%且<=总量的30%"),
new 标度及其说明(5,"主要构件铆钉〈螺栓)有大量损坏、松动或丟失,造成联结部位铆钉〔螺栓>失效,主要构件存在明显的永久变形,变形大于规范值","损坏、失效数量>总量的30%"),
}
),
new 检查指标("结构变位",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"承重构件混凝土保护层厚度符合要求,对钢筋耐久性有轻度影响",""),
new 标度及其说明(3,"横向联结件出现松动,纵向接缝开裂较大",""),
new 标度及其说明(4,"主要构件存在明显的永久变形,变形小于或等于规范值,或桥面竖向呈波形",""),
new 标度及其说明(5,"主要构件存在明显的永久变形,变形大于规范值,结构振动或摇晃显著、有不正常移动",""),
}
),
}
        };
        public static 桥梁组成二级部件 钢桁架加劲梁 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.15,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("构件变形",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"构件轻微变形","钢材料构件竖向弯曲矢度<=杆件自由长度的1/1 500,或钢材料纵粱、横梁横向弯曲矢度<=杆件自由长度的1/8000"),
new 标度及其说明(4,"钢构件明显变形","钢材料构件竖向弯曲矢度>跨度的1/1 500且<=跨度的1/1 000,或钢材料纵梁、横梁横向弯曲矢度>杆件自由长度的1/8 000且<=杆件自由长度的1/5 000"),
new 标度及其说明(5,"钢构件严重变形,结构振动或摇晃显著,有不正常移动","钢材料构件竖向弯曲矢度>跨度的1/1 000,或钢材料纵梁、横梁横向弯曲矢度>杆件自由长度的1/5 000"),
}
),
new 检查指标("锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"构件表面锈蚀,且部分氧化皮或油漆层剥落; ","锈蚀累计面积<=构件面积的2%"),
new 标度及其说明(3,"构件表面有较多点烛现象,氧化皮或油漆层因锈蚀而部分剥落或者可以刮除,出现锈蚀成洞现象","锈蚀累计面积>构件面积的2%且<=构件面积的5%,或锈蚀孔洞<=2个,孔洞直径<=30mm,边缘完好,或腹板、横隔板洞孔直径<=50mm "),
new 标度及其说明(4,"构件表面有严重的点蚀现象,氧化皮或油漆层因锈蚀而全面剥离,较多部位被锈蚀成洞,影响构件安全","锈蚀累计面积>构件面积的5%,或锈蚀孔洞>2个,孔洞直径>30mm,或腹板、横隔板孔洞直径>50mm "),
}
),
new 检查指标("跨中挠度",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"跨中挠度未大于限值","跨中最大挠度<=计算跨径的1/600"),
new 标度及其说明(4,"跨中挠度大于限值","跨中最大挠度>计算跨径的1/600且<=计算跨径的1/400"),
new 标度及其说明(5,"跨中挠度大于限值,主梁严重变形,梁体出现严重病害,有不正常移动并影响结构安","跨中最大挠度>计算跨径的1/400"),
}
),
new 检查指标("裂缝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"钢构件出现极少量细小裂纹",""),
new 标度及其说明(3,"钢构件出现较多细小裂缝,截面削弱","加劲梁、纵横梁受拉翼缘边裂缝长度<=3mm,或受拉翼缘焊接盖板端部裂缝长度<=10mm"),
new 标度及其说明(4,"钢构件出现较多裂缝,截面削弱","加劲梁、纵横梁受拉翼缘边裂缝长度>3mm且<=5mm,或受拉翼缘焊接盖板端部裂缝长度>10mm且<=20mm "),
new 标度及其说明(5,"钢构件严重裂缝,主梁变形,截面削弱,造成严重安全隐患","加劲梁、纵横梁受拉翼缘边裂缝长度>5mm ,或受拉翼缘焊接盖板端部裂缝长度>20mm "),
}
),
new 检查指标("涂层劣化",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"涂层个别位置出现流痕、气泡、白化、漆膜发黏、针孔、起皱或皱纹、表面粉化、变色起皮、脱落等缺陷","累计面积<=构件面积的10% "),
new 标度及其说明(3,"涂层出现较严重流痕、气泡、白化、漆膜发黏、针孔、起皱或皱纹、表面粉化、变色起皮、脱落等缺陷","累计面积>构件面积的10%且<=构件面积的50%"),
new 标度及其说明(4,"涂层出现严重流痕、气泡、白化、漆膜发黏、针孔、起皱或皱纹、表面粉化、变色起皮、脱落等缺陷","累计面积>构件面积的50%"),
}
),
new 检查指标("焊缝开裂",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"焊缝部位涂层有少量裂纹",""),
new 标度及其说明(3,"焊缝部位涂层有大量裂纹,受拉翼缘边焊缝存在裂缝,其他部位焊缝无裂缝","累计面积>构件面积的5%且<构件面积的10%,或单处面积>0.5m2且<1.0m2"),
new 标度及其说明(4,"主要构件焊缝出现较多裂缝,构件出现变形","主粱、纵横粱受拉翼缘边焊缝开裂长度>5mm且<=10mm,其他位置焊缝开裂长度<=5mm "),
new 标度及其说明(5,"主要构件焊缝存在大量裂缝甚至完全开裂,主要构件存在明显的变形,变形大于规范值","主梁、纵横粱受拉翼缘边焊缝开裂长度>10mm,其他位置焊缝开裂长度>5mm "),
}
),
new 检查指标("铆钉或螺栓",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"铆钉〈螺栓)少量损坏、松动或丢失,造成联结部位铆钉〈螺栓)失效","损坏、失效数量<总量的1%"),
new 标度及其说明(3,"铆钉〖螺栓)有较多损坏、松动或丟失,造成联结部位铆钉〈螺栓)失效","损坏、失效数量>总量的1%且<=总量的10%"),
new 标度及其说明(4,"主要构件铆钉〈螺栓)有较多损坏、松动或丢失,造成联结部位铆钉〈螺栓)失效,构件出现明显变形","损坏、失效数量>总量的10%且<=总量的30%"),
new 标度及其说明(5,"主要构件铆钉〈螺栓)有大量损坏、松动或丟失,造成联结部位铆钉〔螺栓>失效,主要构件存在明显的永久变形,变形大于规范值","损坏、失效数量>总量的30%"),
}
),
new 检查指标("结构变位",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"承重构件混凝土保护层厚度符合要求,对钢筋耐久性有轻度影响",""),
new 标度及其说明(3,"横向联结件出现松动,纵向接缝开裂较大",""),
new 标度及其说明(4,"主要构件存在明显的永久变形,变形小于或等于规范值,或桥面竖向呈波形",""),
new 标度及其说明(5,"主要构件存在明显的永久变形,变形大于规范值,结构振动或摇晃显著、有不正常移动",""),
}
),
}
        };
        public static 桥梁组成二级部件 索塔 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.2,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("倾斜变形",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"有倾斜变形现象或存在扭转现象,但较轻微,不影响结构安全",""),
new 标度及其说明(4,"有较大倾斜变形或存在明显扭转,造成安全隐患",""),
new 标度及其说明(5,"索塔出现严重倾斜变形,塔根明显裂缝,塔顶偏移超过限值,严重影响结构安全",""),
}
),
new 检查指标("蜂窝麻面",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好 ",""),
new 标度及其说明(2,"局部蜂窝麻面","累计面积<=构件面积的3% ,单处面积<=0.5m2"),
new 标度及其说明(3,"大面积蜂窝麻面","累计面积>构件面积的20% ,单处面积>3.0m2"),
}
),
new 检查指标("剥落露筋",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"局部混凝土剥落或露筋","累计面积<=构件面积的3%,单处面积<=0.5m2 "),
new 标度及其说明(3,"较大范围混凝土剥落或露筋","累计面积>构件面积的3%且<=构件面积的10%,单处面积>0.5m2 "),
new 标度及其说明(4,"大范围混凝土剥落或露筋","累计面积>构件面积的10%,单处面积>0.5m2"),
}
),
new 检查指标("钢筋锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好,无锈蚀现象","钢筋锈蚀电位水平<=0mV且>=-200Mv;或电阻率>20000Ω•cm "),
new 标度及其说明(2,"有锈蚀现象,混凝土表面有沿钢筋的裂缝或混凝土表面有锈迹; ","钢筋锈蚀电位水平<-200mV且>=-400Mv;或电阻率>10000Ω•cm且<=20000Ω•cm "),
new 标度及其说明(3,"钢筋锈蚀,主筋锈蚀或混凝土表面保护层剥落","钢筋锈蚀电位水平<-400mV且>=-500Mv;或电阻率>=5000Ω•cm且<10000Ω•cm "),
new 标度及其说明(4,"钢筋严重锈蚀,混凝土表面开裂严重","钢筋锈蚀电位水平<-500mV;或电阻率<5000Ω•cm "),
}
),
new 检查指标("混凝土裂缝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好,无裂缝",""),
new 标度及其说明(2,"网状裂缝:局部网状裂缝;其他裂缝：有少量裂缝,缝宽来超限","网状裂缝:累计面积<=构件面积的20%,单处面积<=1.0m2;其他裂缝:缝长<=截面尺寸的1/3"),
new 标度及其说明(3,"网状裂缝:局部网状裂缝;其他裂缝：有大量裂缝,缝宽来超限","网状裂缝:累计面积>构件面积的20%,单处面积  >1.0m2;其他裂缝:缝长>截面尺寸的1/3且<=截面尺寸的2/3,间距>=20cm"),
new 标度及其说明(4,"有大量裂缝,裂缝缝宽超限","缝宽>限值,缝长>截面尺寸的2/3,间距<20cm"),
}
),
new 检查指标("沉降",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"索塔有轻微沉降,但沉降稳定",""),
new 标度及其说明(3,"索塔有小幅度沉降,但沉降稳定",""),
new 标度及其说明(4,"索塔沉降较大,但沉降稳定",""),
new 标度及其说明(5,"索塔或索塔基础出现严重不均匀沉降或位移,影响结构安全",""),
}
),
new 检查指标("基础冲刷",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"基础基本无局部冲刷现象",""),
new 标度及其说明(3,"基础出现局部冲刷现象,程度较轻",""),
new 标度及其说明(4,"基础出现较严重局部冲刷现象",""),
new 标度及其说明(5,"基础出现严重局部冲刷现象,基础不稳定,出现严重滑动、下沉、位移、倾斜等现象",""),
}
),
}
        };
        public static 桥梁组成二级部件 橡胶支座 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.05,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("支座老化开裂",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"轻微老化,表面有脏污,出现裂缝","裂缝宽度<=1.0,裂缝长度>相应边长10%"),
new 标度及其说明(3,"橡胶支座老化变形,裂缝较严重","裂缝宽度>1mm且<=2mm,裂缝长度>相应边长的25%"),
new 标度及其说明(4,"橡胶支座老化破裂,裂缝严重,且造成其他构件产生较严重病害","裂缝宽度>2mm,裂缝长度>相应边长的25%"),
new 标度及其说明(5,"橡胶支座老化破裂,裂缝非常严重,已经失去正常支承功能,且使相关上下部结构受到异常约束,造成严重损坏,主梁出现严重变形","裂缝宽度>2mm,裂缝长度>相应边长的50%"),
}
),
new 检查指标("支座缺陷",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"有外鼓现象","沿支座一侧外鼓长度<=相应边长的10%"),
new 标度及其说明(3,"外鼓现象较严重,或钢板局部外露","沿支座一侧外鼓长皮>相应边的10%且<=相应边长的25%,或钢板外露长度>100mm "),
new 标度及其说明(4,"外鼓现象严重,或钢板大部分外露","沿支座一侧外鼓长度>相应边长的25%,或钢板外露长度>100mm "),
}
),
new 检查指标("支座位置串动脱空或剪切超限",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"支座出现剪切变形或位置略有偏移",""),
new 标度及其说明(3,"支座出现剪切变形或位置有较大偏移","剪切角度<=45゜"),
new 标度及其说明(4,"支座串动较严重,或出现脱空现象,或出现严重变形","串动长度<=相应边长的25%,或剪切角度>45゜且<=60゜"),
new 标度及其说明(5,"串动严重并造成桥梁其他构件出现较严重病害;支座错位、串动、变形严重,已经失去正常支承功能,造成相关上下部结构严重损坏, 主梁出现严重变形","串动长度>相应边长的25%;剪切角度>60゜"),
}
),
new 检查指标("支座组件损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"盆底四角翘起,或钢盆出现较多锈蚀,或支座底板局部裂纹、掉角",""),
new 标度及其说明(3,"钢件非主要受力部位出现脱焊,或钢盆出现较多锈蚀并伴有剥落,或除盆底、盆环外其他部位开裂,或底板产生变形,混凝土酥裂,露筋、掉角",""),
new 标度及其说明(4,"大量锚栓剪断,或底板变形,大部分压碎、剥离,造成相关上下部结构受到异常约束,损坏严重","锚栓剪断<=50%"),
new 标度及其说明(5,"有大量的锚栓剪断或盆环开裂、脱焊,支座破损、缺失严重,已经失去正常支承功能,造成相关上下部结构严重损坏,主梁出现严重变形","锚栓剪断>50%"),
}
),
new 检查指标("聚四氟乙烯滑板磨损",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"磨损较少","聚四氟乙烯滑板外露高度>=0.5mm "),
new 标度及其说明(3,"磨损较多","聚四氟乙烯滑板外露高度>=0.2mm且<0.5mm "),
new 标度及其说明(4,"磨损严重,并造成其他构件出现病害","聚四氟乙烯滑板外露高度<0.2mm "),
}
),
new 检查指标("支座位移转角超限",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,""," "),
new 标度及其说明(3,"有位移现象,或有较大转角,转角超出设计值","位移<=10mm,或转角<=设计转角20% "),
new 标度及其说明(4,"位移现象较明显,或有很大转角,转角远超出设计值","聚位移>10mm,或转角>设计转角20% "),
}
),
}
        };
        public static 桥梁组成二级部件 钢支座 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.05,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("支座组件或功能缺陷",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"有锈蚀现象;或牙板咬死;或个别锚栓出现剪断现象;或底板与垫石没有密贴,出现较大缝隙","锚栓剪断数量<=5%;或底板与垫石间缝隙宽度<=2.0mm,;深度>50mm "),
new 标度及其说明(3,"大部分有锈蚀现象,并有剥落,或非主要受力部件出现脱焊;或牙板折断,辊轴连杆螺丝剪断;或锚栓剪断数量较多,螺杆松动;或底板与垫石没有密贴,出现很大的缝隙,出现翻浆、积水","锚栓剪断数量>5%且<=30%;或底板与垫石缝隙宽度>2.0mm,深度>=支座相应边长的25%"),
new 标度及其说明(4,"主要受力部件脱焊;或支座不能活动;或大量锚钉或锚栓剪断;或垫石出现严重裂损","锚钉或锚栓剪断数量>30%"),
}
),
new 检查指标("支座位移转角超限",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"位移大于限值","纵向位移<= 5mm,或横向位移<=2mm "),
new 标度及其说明(4,"位移大于限值严重,或倾斜度超标","纵向位移>5mm,或横向位移>2mm "),
}
),
new 检查指标("支座部件磨损裂缝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"钢部件磨损出现凹陷,或出现微裂缝","磨损凹陷<=1.0mm,或裂缝深度<=5.0mm"),
new 标度及其说明(3,"钢部件磨损出现凹陷,或出现较大裂缝","磨损凹陷>1.0mm 且<=3.0mm,或裂缝深度>5.0mm且<=10.0mm"),
new 标度及其说明(4,"钢部件磨损出现严重凹陷,或出现较严重裂缝","磨损凹陷>3.0mm,或裂缝深度>10.0mm "),
}
),
}
        };
        public static 桥梁组成二级部件 混凝土摆式支座 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.05,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("混凝土缺陷",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"局部混凝土脱皮、露筋、裂纹、剥离、掉角","累计面积<=构件面积的5%"),
new 标度及其说明(3,"较大范围混凝土脱皮、露筋、酥裂","累计面积>构件面积的5%且<=构件面积的20%,或单处面积<=构件面积的1.0m2"),
new 标度及其说明(4,"大范围混凝土脱皮、露筋、压碎","累计面积>构件面积的20%"),
}
),
new 检查指标("活动支座滑动面不平整或生锈咬死",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"滑动面不平整、出现生锈现象",""),
new 标度及其说明(4,"滑动面不平整、生锈咬死,支座不活动",""),
}
),
new 检查指标("轴承有裂缝切口或偏移",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"轴承有裂纹、切口或偏移,影响了活动能力",""),
new 标度及其说明(4,"轴承有裂纹、切口或偏移,失去了活动能力",""),
}
),
}
        };
        public static 桥梁组成二级部件 悬索桥特殊支座 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.05,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("螺纹螺帽松动或锚螺杆剪切",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"个别螺纹、螺帽轻微松动,或个别锚螺杆;出现轻微剪切变形",""),
new 标度及其说明(3,"螺紋、螺帽出现松动,个别出现脱落,或锚螺杆出现剪切变形甚至剪断","螺纹、螺帽松动数量<=3% ,或锚螺杆剪切变形数量<=10%"),
new 标度及其说明(4,"螺纹、螺帽出现松动、脱落甚至个别.出现断裂,或锚螺杆出现剪切变形、剪断现象,并且造成相关上下部结构受到异常约束,出现损坏","螺纹、螺帽出现松动、脱落甚至断裂的数量> 3%且<=10%,或锚螺杆出现剪切变形数量>10%且<=20%,锚螺杆剪断数量<=10%"),
new 标度及其说明(5,"螺纹、螺帽松动、脱落、断裂现象,或锚螺杆出现剪切变形、剪断现象,支座已经失去正常支承功能,并且造成相关1：下部结构受到异常约束,严重损坏,主梁出现严重变形或挠度大于限值","螺纹、螺帽出现松动、脱落甚至断裂的数量>10%,或锚螺杆出现剪切变形数量>20%,锚螺杆剪断数量>10%"),
}
),
new 检查指标("上下座板盆锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"局部出现锈蚀","锈蚀面积<=5%"),
new 标度及其说明(3,"出现锈蚀,个别位置有剥落","锈蚀面积>5%且<=20%"),
new 标度及其说明(4,"出现锈蚀,大多数位置有剥落","锈蚀面积>20%"),
}
),
new 检查指标("纵横线扭转",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"纵横线发生轻微扭转","纵横线扭转<=1.0mm"),
new 标度及其说明(4,"纵横线发生较大扭转","纵横线扭转>1.0mm"),
}
),
}
        };
        public static 桥梁组成二级部件 主鞍 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.04,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("上座板与下座板的相对位移",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"",""),
new 标度及其说明(3,"",""),
new 标度及其说明(4,"上座板与下座板有相对位移"," "),
}
),
new 检查指标("主鞍螺杆锚栓状况",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"个别螺杆、锚栓连接出现松动",""),
new 标度及其说明(3,"少部分螺杆、锚栓连接出现松动",""),
new 标度及其说明(4,"较多数量的螺杆、锚栓连接松动,个别螺杆、锚栓连接脱落",""),
}
),
new 检查指标("锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"构件表面有轻微锈蚀,但无可见油脂和污垢,且没有附着不牢的氧化皮、铁锈和油漆层","锈蚀面积<=构件面积的3%"),
new 标度及其说明(3,"构件表面锈蚀,且部分氧化皮或油漆层剥落","锈蚀面积>构件面积的3%且<=构件面积的5%"),
new 标度及其说明(4,"构件表面有大量点蚀现象,氧化皮或油漆层因锈蚀而部分剥落或者可以刮除","锈蚀面积>构件面积的5%"),
}
),
}
        };
        public static 桥梁组成二级部件 主缆 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.25,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("主缆防护损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"主缆防护表面有局部面漆变色起皮,个别位置出现破损、老化、漏水","面漆变色起皮面积<=3%,或防护破损面积<=1%"),
new 标度及其说明(3,"主缆表面面漆有部分损坏、裂纹、变色起皮或剥落;局部位置出现破损、老化、漏水;或极少的部位缠丝外露,且没有生锈","防护破损面积>1%且<=10%;缠丝外露数量<=3%"),
new 标度及其说明(4,"主缆表面较大范围面漆有轻微损坏、裂纹、变色起皮或剥落;局部位置出现破损、老化、漏水;或局部缠丝外露并伴有生锈","防护破损面积>10%;缠丝外露数量>3%"),
}
),
new 检查指标("主缆线形",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"主缆线形完好",""),
new 标度及其说明(2,"主缆线形正常",""),
new 标度及其说明(3,"主缆变形,但小于设计允许值",""),
new 标度及其说明(4,"主缆变形较大,不可恢复的变化小于或等于设计允许值",""),
new 标度及其说明(5,"主缆变形较为严重,不可恢复的变化大于设计允许值",""),
}
),
new 检查指标("扶手绳及栏杆绳损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"检修道上扶手绳及栏杆绳有伤痕并有起丝现象",""),
new 标度及其说明(3,"扶手绳、栏杆绳出现多处伤痕","截面损失>30%"),
new 标度及其说明(4,"扶手绳或栏杆绳有断裂现象",""),
}
),
new 检查指标("主缆腐蚀或索股损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"主缆局部出现轻微脱皮、锈蚀、伤痕或有麻点,或镀锌钢丝出现少量锌腐蚀亮斑,失去光泽",""),
new 标度及其说明(3,"主缆出现少量脱皮、伤痕或轻度至中度腐蚀,缠丝层有较多麻坑,或镀锌钢丝出现较多锌腐蚀,并有白色腐蚀产物,尚未见铁腐蚀",""),
new 标度及其说明(4,"主缆出现较多脱皮、伤痕或密布的中等大小腐坑,缠丝层有大量的麻坑,或鍍锌钢丝锌层减少,出现铁腐蚀斑点和腐坑",""),
new 标度及其说明(5,"主缆缠丝防锈层已经严重腐蚀、断经,或出现严重脱皮、伤痕、断丝,或鍍锌钢丝严重腐蚀、断丝",""),
}
),
new 检查指标("涂膜劣化",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"构件表面出现轻微起泡、裂纹、脱落现象, 或构件表面出现轻微粉化现象","起泡、裂紋、脱落、粉化累计面积<=构件面积的10%"),
new 标度及其说明(3,"构件表面出现中等起泡、裂纹、脱落现象, 或构件表面出现中等粉化或锈蚀现象","起泡、裂纹、脱落、粉化、锈蚀累计面积>构件面积的10%。且<=构件面积的20%"),
new 标度及其说明(4,"件表面出现较严重起泡、裂纹、脱落现象,或构件表面出现较严重粉化或锈蚀现象,轻轻擦抹涂层,粘有大量颜料粒子甚至出现漏底","起泡、裂纹、脱落粉化、锈蚀累计面积>构件面积的20%"),
}
),
}
        };
        public static 桥梁组成二级部件 索夹 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.04,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("错位滑移",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"无移动",""),
new 标度及其说明(2,"",""),
new 标度及其说明(3,"别索夹有错位、移动","滑移量<=10mm"),
new 标度及其说明(4,"较多索夹有明显错位、滑动现象;个别索夹位移超限","滑移量>10mm "),
}
),
new 检查指标("面漆起皮",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"索夹面漆局部起皮","索夹起皮的数量<=总数量的5%"),
new 标度及其说明(3,"索夹面漆局部起皮,并伴有锈蚀","索夹起皮的数量>总数量的5%且<=总数量的20%"),
new 标度及其说明(4,"索夹面漆起皮,锈蚀严重","索夹起皮、锈蚀的数量>总数量的20%"),
}
),
new 检查指标("索夹密封填料损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"索夹填料局部轻微老化,表面有脏污","数量<=总数量的3%"),
new 标度及其说明(3,"索夹填料老化、局部有开裂剥落,部分发生变形","数量>总数量的3%且<=总数量的10%"),
new 标度及其说明(4,"索夹填料老化、局部有开裂剥落","数量<总数量的10%"),
}
),
new 检查指标("裂缝和锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"索夹个别部位出现明显轻微裂纹,或表面有少量点蚀、锈斑",""),
new 标度及其说明(3,"大量索夹外观有较多明显裂缝,或表面普遍有点蚀、锈斑或锈坑",""),
new 标度及其说明(4,"大量夹壁开裂,索夹眼板开裂,索夹严重锈蚀",""),
}
),
}
        };
        public static 桥梁组成二级部件 吊索 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.17,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("渗水",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"有轻微渗水现象",""),
new 标度及其说明(3,"个别构件防水渗透装置损坏,明显渗水,构件有锈蚀现象",""),
new 标度及其说明(4,"较多构件防水渗透装置损坏,多处构件明显渗水,构件渗水处伴有较严重锈蚀现象",""),
}
),
new 检查指标("锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好","无"),
new 标度及其说明(2,"表面有少量油脂和污垢,没有附着不牢的氧化皮、铁锈和油漆层,或表面有少量点蚀、锈斑,或镀锌钢丝出现锌腐蚀亮斑",""),
new 标度及其说明(3,"表面普遍有点蚀、锈斑、锈坑,或氧化皮、油漆层因锈蚀而部分剥落或者可以刮除,或钢丝发生较严重锈蚀,或镀锌钢丝锌层出现铁腐蚀斑点和腐坑; ","锈蚀面积<=构件面积5%,或构件表面锈蚀孔洞<=2个"),
new 标度及其说明(4,"表面普遍有点蚀现象,氧化皮或油漆层因锈蚀而全面剥离,或钢丝发生较严重锈蚀并有部分断裂,或镀锌钢丝严重腐蚀有开裂现象","锈蚀面积>构件面积5%,或构件表面锈蚀孔洞>2个"),
}
),
new 检查指标("锚头损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"个别锚头轻微破损",""),
new 标度及其说明(3,"个别锚头破损、松动",""),
new 标度及其说明(4,"较多锚头破损、松动或裂缝,个别冷铸锚头破损严重或裂缝超限,严重影响构件安全",""),
}
),
new 检查指标("橡胶老化变质",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好,无裂缝"," "),
new 标度及其说明(2,"吊索端部及减振器部位橡胶轻微老化,表面有脏污;或减振措施极个别处表面轻微损坏"," "),
new 标度及其说明(3,"吊索端部及减振器部位橡胶老化变形;或减振措施个别处出现松动或损坏",""),
new 标度及其说明(4,"吊索端部及减振器部位橡胶老化变形,并有破裂现象,局部还造成渗水;或减振措施出现较多处损坏,失去效用",""),
}
),
new 检查指标("掉漆起皮",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"吊索表面局部面漆变色、起泡","累计面积<=构件面积的5%"),
new 标度及其说明(3,"吊索表面较大范围面漆轻微起皮、起泡或剥落","累计面积>构件面积的5%且<=构件面积的15%"),
new 标度及其说明(4,"吊索表面较大范围面漆起皮、起泡或剥落","累计面积>构件面积的15%"),
}
),
new 检查指标("防护套破坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"个别防护套及连接处轻微松动",""),
new 标度及其说明(3,"部分防护套以及连接处松动或套管顶没有密封",""),
new 标度及其说明(4,"较多防护套以及连接处松动或套管顶没有密封,局部造成渗水",""),
}
),
new 检查指标("吊索的防护层破坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"个别吊索防护层轻微老化或破损",""),
new 标度及其说明(3,"个别吊索防护层老化、破损、裂纹",""),
new 标度及其说明(4,"吊索防护层老化、破损、裂纹或积水,造成局部渗水或锈蚀并伴有钢丝严重锈蚀现象",""),
}
),
new 检查指标("钢丝断丝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(3,"钢丝少量锈蚀,无断丝",""),
new 标度及其说明(4,"钢丝锈蚀,防腐层有大量麻坑,甚至出现断丝",""),
new 标度及其说明(5,"吊索钢丝大量严重锈蚀或损坏,钢丝断裂,甚至主梁出现变形,造成安全隐患",""),
}
),
}
        };
        public static 桥梁组成二级部件 锚杆 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.1,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("掉皮",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"较小范围涂层有轻微损坏、裂纹、起皮或剥落","累计面积<=构件面积的10%,单处面积<=0.5m2"),
new 标度及其说明(3,"较大范围涂层有轻微损坏、裂纹、起皮或剥落","累计面积>构件面积的10%且<=构件面积的20%,单处面积>0.5m2且<=1.0m2"),
new 标度及其说明(4,"大范围涂层有轻微损坏、裂紋、起皮或剥落","累计面积>构件面积的20%,单处面积>1.0m2"),
}
),
new 检查指标("锈蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"构件表面有轻微锈蚀,但无可见油脂和污垢,且没有附着不牢的氧化皮、铁锈和油漆层","锈蚀面积<=构件面积的5%"),
new 标度及其说明(3,"构件表面锈蚀,且部分氧化皮或油漆层剥落,个别有明显变位","锈蚀面积>=构件面积的5%且<=构件面积的10%"),
new 标度及其说明(4,"构件严重锈蚀,个别板件锈穿极易撕裂, 氧化皮或油漆层因锈蚀而部分剥落或者可以刮除","锈蚀面积>构件面积的10%"),
}
),
new 检查指标("裂纹",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"锚杆存在轻微裂紋,但符合相关规范要求",""),
new 标度及其说明(3,"锚杆有较多裂纹,不符合相关规范要求,局部有锈蚀现象",""),
new 标度及其说明(4,"锚杆外观有大量裂纹,个别部位裂纹超限,不符合相关规范要求,锈蚀现象严重,严重影响结构安全",""),
}
),
}
        };
        public static 桥梁组成二级部件 锚碇 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = true,
            部件权重 = 0.4,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("锚坑漏水",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"锚坑内无渗漏水现象",""),
new 标度及其说明(2,"锚坑有明显渗漏水现象",""),
new 标度及其说明(3,"锚坑漏水较严重,伴有锈烛现象",""),
new 标度及其说明(4,"锚坑渗漏水严重,多处锈蚀",""),
}
),
new 检查指标("顶板侧墙损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"顶板、侧墙表面状况完好",""),
new 标度及其说明(2,"顶板、侧墙有局部麻面沉积物"," "),
new 标度及其说明(3,"顶板、侧墙出现锈迹、蜂窝、渗出物,伴有细微裂缝",""),
new 标度及其说明(4,"顶板及侧墙出现大面积锈迹,混凝土剥落,钢筋外露锈蚀,有较大裂缝",""),
}
),
new 检查指标("锚碇均匀沉降",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"锚碇无沉降",""),
new 标度及其说明(2,"",""),
new 标度及其说明(3,"锚碇有轻微沉降","沉降<=10mm"),
new 标度及其说明(4,"锚碇沉降较严重","沉降>10mm且<=50mm"),
new 标度及其说明(5,"锚碇沉降严重","沉降>50mm"),
}
),
new 检查指标("表观病害",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"",""),
new 标度及其说明(3,"锚碇个别部位出现明显表观病害如裂缝、剥落、露筋、钢筋锈蚀、空洞等",""),
new 标度及其说明(4,"锚碇外观有较多表观病害且情况严重,如裂缝、剥落、露筋、钢筋锈蚀、空洞等,不符合相关规范要求"," "),
}
),
new 检查指标("水平位移",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"",""),
new 标度及其说明(3,"",""),
new 标度及其说明(4,"",""),
new 标度及其说明(5,"","有水平位移"),
}
),
}
        };
        public static 桥梁组成二级部件 索塔基础 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.3,
            构件数 = 2,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("冲刷淘空",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"基础无冲蚀现象,表面长有青苔、杂草",""),
new 标度及其说明(3,"基础有局部冲蚀现象,部分外露,但未露出基底","基础冲空面积<=10%"),
new 标度及其说明(4,"浅基被冲空,露出底面,冲刷深度大于设计值","基础冲空面积>10%且<=20%"),
new 标度及其说明(5,"冲刷深度大于设计值,地基失效,承载力降低,或桥台岸坡滑移或基础无法修复","基础冲空面积>20%"),
}
),
new 检查指标("剥落露筋",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"承台出现少量剥落、露筋、锈蚀现象,或基础少量混凝土剥落","累计面积<=构件面积的3%,单处面积<=0.25m2"),
new 标度及其说明(3,"承台较大范围出现剥落、露筋、锈蚀现象,或基础小范围出现剥落、露筋、锈蚀现象","剥落、露筋累计面积>构件面积的3%且<=构件面积的10%,单处面积>0.25m2且<=1.0m2"),
new 标度及其说明(4,"承台大范围出现严重剥落、露筋、锈蚀现象且混凝土出现严重锈蚀裂缝,或基础较大范围出现剥落、露筋,主筋严重锈蚀","剥落、露筋累计面积>构件面积的10%且<=构件面积的20%,单处面积>1.0m2"),
new 标度及其说明(5,"基础大量剥落、露筋且主筋有锈断现象,基础失稳","基础剥落、露筋累计面积、构件面积的20%,单处面积>1.0m2"),
}
),
new 检查指标("冲蚀",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"基础或承台有轻微磨损、腐蚀现象,个别部位表面磨耗,粗骨料显露","累计面积<=构件面积的3% "),
new 标度及其说明(3,"基础或承台大范围被侵蚀,有磨损、缩颈、露筋或者环状冻裂现象;或桩基顶面出现较大空洞","累计面积>构件面积的3%且<=构件面积的10% "),
new 标度及其说明(4,"混凝土腐蚀或钢筋大量锈蚀并有锈断现象;或有严重冻融现象,造成大面积混凝土胀裂","累计面积>构件面积的10% "),
}
),
new 检查指标("河底铺砌损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"河底铺砌完好,无冲刷现象"," "),
new 标度及其说明(2,"河底铺砌局部轻微冲刷或损坏",""),
new 标度及其说明(3,"河底铺砌冲刷较重或损坏严重",""),
new 标度及其说明(4,"河底铺砌出现严重冲刷淘空或损坏",""),
}
),
new 检查指标("沉降",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"",""),
new 标度及其说明(3,"出现轻微的下沉,发展缓慢或下沉趋于稳定",""),
new 标度及其说明(4,"出现下沉现象,沉降量小于或等于规范值",""),
new 标度及其说明(5,"基础不稳定,下沉现象严重,沉降量大于规范值,造成上部结构和桥面系变形过大",""),
}
),
new 检查指标("滑移和倾斜",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"",""),
new 标度及其说明(3,"出现滑移或倾斜,导致支座和墩台支承面轻微损坏,或导致伸缩装置破坏、接缝减小、伸缩机能受损,但发展缓慢或下沉趋于稳定",""),
new 标度及其说明(4,"基础出现滑移或倾斜,导致支座和墩台支承面被严重破坏,或导致伸缩装置破坏、接缝减小、伸缩机能完全丧失,或滑移量过大,梁端与胸墙紧贴",""),
new 标度及其说明(5,"滑移量过大导致前墙破坏或局部破碎、压曲,或基础不稳定,滑移或倾斜现象严重,或导致梁体从支承面上滑落",""),
}
),
new 检查指标("裂缝",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"结构应力异常,出现剪切裂缝,缝宽未超限","缝长<=截面尺寸的1/3"),
new 标度及其说明(3,"结构应力异常,出现剪切裂缝,缝宽未超限","缝长>截面尺寸的1/3且<=截面尺寸的1/2"),
new 标度及其说明(4,"结构应力异常,出现剪切裂缝或混凝土出现碎裂","缝宽>限值且<=1.0mm,缝长>截面尺寸的1/2"),
new 标度及其说明(5,"结构应力异常,出现剪切裂缝,裂缝贯通,基础处于失稳状态,或基础出现结构性裂缝甚至断裂","缝宽>1. 0mm,缝长>截面尺寸的1/2"),
}
),
}
        };
        public static 桥梁组成二级部件 河床 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.1,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("堵塞",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"局部有漂流物,堵塞河道",""),
new 标度及其说明(3,"多处有漂流物堵塞河道",""),
new 标度及其说明(4,"河道被完全堵塞 ",""),
}
),
new 检查指标("冲刷",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"河床稳定,无冲刷现象",""),
new 标度及其说明(2,"局部轻微冲刷"," "),
new 标度及其说明(3,"冲刷较重,墩台底有淘空现象,防护体损坏严重"," "),
new 标度及其说明(4,"河床压缩,出现严重冲刷淘空,危及桥梁安全",""),
}
),
new 检查指标("河床变迁",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"局部轻微淤积"," "),
new 标度及其说明(3,"河床淤泥严重,河床扩宽有变迁趋势",""),
new 标度及其说明(4,"已出现变迁、扩宽现象,并有发展趋势",""),
}
),
}
        };
        public static 桥梁组成二级部件 调治构造物 = new 桥梁组成二级部件()
        {
            IsExist = true,
            是否主要部件 = false,
            部件权重 = 0.05,
            构件数 = 1,
            检查指标集合 = new ObservableCollection<检查指标>()
{
new 检查指标("损坏",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"构造物局部断裂,砌体松动、鼓肚、凹陷或灰浆脱落",""),
new 标度及其说明(3,"表面出现大面积损坏或坡脚局部损坏",""),
new 标度及其说明(4,"需要设置但没有设置调治构造物者",""),
}
),
new 检查指标("冲刷变形",new ObservableCollection<标度及其说明>
{
new 标度及其说明(1,"完好",""),
new 标度及其说明(2,"边坡局部下滑,基础局部冲空"," "),
new 标度及其说明(3,"边坡大面积下滑,构造物出现下沉、倾斜,局部坍塌"," "),
new 标度及其说明(4,"构造物出现下沉、<=顷斜、坍塌,基础冲蚀严重",""),
}
),
}
        };
        public static 桥梁组成一级部件 桥面系_一级部件_桥面铺装 = new 桥梁组成一级部件("桥面铺装", 0.4, false, new ObservableCollection<桥梁组成二级部件> { 桥面铺装 });
        public static 桥梁组成一级部件 桥面系_一级部件_伸缩缝 = new 桥梁组成一级部件("伸缩缝", 0.25, false, new ObservableCollection<桥梁组成二级部件> { 伸缩缝 });
        public static 桥梁组成一级部件 桥面系_一级部件_人行道 = new 桥梁组成一级部件("人行道", 0.1, false, new ObservableCollection<桥梁组成二级部件> { 人行道 });
        public static 桥梁组成一级部件 桥面系_一级部件_栏杆及护栏 = new 桥梁组成一级部件("栏杆及护栏", 0.1, false, new ObservableCollection<桥梁组成二级部件> { 栏杆及护栏 });
        public static 桥梁组成一级部件 桥面系_一级部件_排水系统 = new 桥梁组成一级部件("排水系统", 0.1, false, new ObservableCollection<桥梁组成二级部件> { 排水系统 });
        public static 桥梁组成一级部件 桥面系_一级部件_照明及标志 = new 桥梁组成一级部件("照明及标志", 0.05, false, new ObservableCollection<桥梁组成二级部件> { 照明及标志 });

        public static 桥梁组成一级部件 上部结构_一级部件_主梁 = new 桥梁组成一级部件("主梁", 0.15, false, new ObservableCollection<桥梁组成二级部件> { 混凝土主梁, 钢箱加劲梁, 钢桁架加劲梁 });
        public static 桥梁组成一级部件 上部结构_一级部件_索塔 = new 桥梁组成一级部件("索塔", 0.2, false, new ObservableCollection<桥梁组成二级部件> { 索塔 });
        public static 桥梁组成一级部件 上部结构_一级部件_支座 = new 桥梁组成一级部件("支座", 0.05, false, new ObservableCollection<桥梁组成二级部件> { 橡胶支座, 钢支座, 混凝土摆式支座, 悬索桥特殊支座 });
        public static 桥梁组成一级部件 上部结构_一级部件_主鞍 = new 桥梁组成一级部件("主鞍", 0.04, false, new ObservableCollection<桥梁组成二级部件> { 主鞍 });
        public static 桥梁组成一级部件 上部结构_一级部件_主缆 = new 桥梁组成一级部件("主缆", 0.25, false, new ObservableCollection<桥梁组成二级部件> { 主缆 });
        public static 桥梁组成一级部件 上部结构_一级部件_索夹 = new 桥梁组成一级部件("索夹", 0.04, false, new ObservableCollection<桥梁组成二级部件> { 索夹 });
        public static 桥梁组成一级部件 上部结构_一级部件_吊索 = new 桥梁组成一级部件("吊索", 0.17, false, new ObservableCollection<桥梁组成二级部件> { 吊索 });
        public static 桥梁组成一级部件 上部结构_一级部件_锚杆 = new 桥梁组成一级部件("锚杆", 0.1, false, new ObservableCollection<桥梁组成二级部件> { 锚杆 });

        public static 桥梁组成一级部件 下部结构_一级部件_锚碇 = new 桥梁组成一级部件("锚碇", 0.4, false, new ObservableCollection<桥梁组成二级部件> { 锚碇 });
        public static 桥梁组成一级部件 下部结构_一级部件_索塔基础 = new 桥梁组成一级部件("索塔基础", 0.3, false, new ObservableCollection<桥梁组成二级部件> { 索塔基础 });
        //public static 桥梁组成一级部件 上部结构_一级部件_散索鞍 = new 桥梁组成一级部件("散索鞍", 0.2, false, new ObservableCollection<桥梁组成二级部件> { 散索鞍 });
        public static 桥梁组成一级部件 下部结构_一级部件_河床 = new 桥梁组成一级部件("河床", 0.1, false, new ObservableCollection<桥梁组成二级部件> { 河床 });
        public static 桥梁组成一级部件 下部结构_一级部件_调治构造物 = new 桥梁组成一级部件("调治构造物", 0.05, false, new ObservableCollection<桥梁组成二级部件> { 调治构造物 });
    }
}
